{"This user is seeking books that can aid her young 11-year-old daughter in understanding and coming to terms with starting her period, as it seems the experience was quite traumatic for her. The books should be gentle, reassuring, and comfortingly communicate the message that menstruation is a normal part of life. The girl is not very verbal but enjoys reading, so the parent is hoping to communicate with her through literature. Importantly, the books should be appropriate for a less mature 11-year-old, as her understanding and emotional maturity may not be as advanced as her peers. The user also would prefer the books don't delve too much into topics like tampons due to her young age.": {"positive": ["\"Our Bodies, Ourselves\" by Boston Women's Health Book Collective", "\"Are You There, God? It's Me, Margaret\" by Judy Blume", "\"The Period Book : Everything You Don't Want to Ask (But Need to Know)\" by Jennifer Gravelle, Karen, and Gravelle", "\"A Smart Girl's Guide to Sticky Situations: How to Tackle Tricky, Icky Problems and Tough Times\" by American Girl Editors", "\"Alanna: The First Adventure\" by Tamora Pierce"], "negative": ["\"The Fifth Season\" by N.K. Jemisin", "\"Siddhartha\" by Hermann Hesse", "\"The Black Dahlia\" by James Ellroy", "\"Night Watch\" by Terry Pratchett", "\"Shantaram\" by Gregory David Roberts"]}, "The user enjoys non-fiction books that are written in a narrative, engaging style, making them read like fiction. The user's interests include adventure, survival, and real-life crime stories. They have expressed liking for books such as 'Shadow Divers' by Robert Kurson, 'Into Thin Air' and 'Into the Wild' by Jon Krakauer, and 'Killing Pablo' by Mark Bowden. These books share themes of human resilience, explorations, real-life mysteries, and intense experiences.": {"positive": ["\"The Electric Kool-Aid Acid Test\" by Tom Wolfe", "\"Killing Pablo\" by Mark Bowden", "\"Nothing to Envy: Ordinary Lives in North Korea\" by Barbara Demick", "\"The Executioner's Song\" by Norman Mailer", "\"In the Heart of the Sea: The Tragedy of the Whaleship Essex\" by Nathaniel Philbrick"], "negative": ["\"The Lies of Locke Lamora\" by Scott Lynch", "\"The Color of Magic\" by Terry Pratchett", "\"When Helping Hurts: How to Alleviate Poverty Without Hurting the Poor\" by Steve Corbett and Brian Fikkert", "\"Are You There, God? It's Me, Margaret\" by Judy Blume", "\"Fahrenheit 451\" by Ray Bradbury"]}, "This user is an avid reader who is drawn to compelling, addictive page-turners that keep them engrossed till the end. The user appears to enjoy series, particularly those with complex world-building such as the first three books from the 'Wheel of Time' series and 'The Way of Kings' by Brandon Sanderson. They also have a liking for the suspense and mystery genres, as seen from their interest in 'Shadow of the Wind' by Carlos Ruiz Zafon and 'Before I Go To Sleep'. They also appreciate poignant stories with robust characterization, such as 'The Fault in Our Stars'. This reader doesn't limit themselves to a specific genre or type of story, but judges books on their addictiveness and overall enjoyment they provide.": {"positive": ["\"The Passage\" by Justin Cronin", "\"Intensity\" by Dean Koontz", "\"The Name of the Wind\" by Patrick Rothfuss", "\"The Hobbit\" by J.R.R. Tolkien", "\"The Twelve\" by Justin Cronin"], "negative": ["\"The Lion, the Witch and the Wardrobe\" by C. S. Lewis", "\"Night Watch\" by Terry Pratchett", "\"Fahrenheit 451\" by Ray Bradbury", "\"The Sixth Extinction\" by Elizabeth Kolbert", "\"Educated\" by Tara Westover"]}, "This user is seeking books that are humorous, uplifting, and thought-provoking in order to provide comfort and solace to a friend. They prefer books that not only make the reader laugh but also provide intellectual stimulation, as demonstrated by their selection of \"The Humans\" by Matt Haig. They're searching for multiple book options to load onto a Kindle for a friend who is dealing with severe depression.": {"positive": ["\"The Hitchhiker's Guide to the Galaxy\" by Douglas Adams", "\"Lamb\" by Christopher Moore", "\"Good Omens\" by Neil Gaiman and Terry Pratchett", "\"A Confederacy of Dunces\" by John Kennedy Toole", "\"Them\" by Jon Ronson"], "negative": ["\"Black Sun Rising\" by CS Friedman", "\"Leviathan Wakes\" by James S. A. Corey", "\"The Fifth Season\" by N.K. Jemisin", "\"A Wizard of Earthsea\" by Ursula K. Le Guin", "\"I Have No Mouth And I Must Scream\" by Harlan Ellison"]}, "The user is interested in books that center on women who experience loneliness, isolation, or feel like outcasts. The protagonists are often misunderstood by those around them and lack traditional social connections like a spouse or children. These women tend to be introspective and have a deep love for something, be it books, language, nature, or just surviving. The user enjoys books where the characters create meaning and purpose through their own unique paths, even in challenging circumstances. Examples of books they enjoyed include \"Unnecessary Woman,\" \"What Was She Thinking? Notes on a Scandal,\" \"She's Come Undone,\" \"Middlesex,\" \"Where The Crawdads Sing,\" and \"Eleanor Oliphant is completely fine\".": {"positive": ["\"Eileen\" by Ottessa Moshfegh", "\"Rest and Relaxation\" by Ottessa Moshfegh", "\"We Have Always Lived in the Castle\" by Shirley Jackson", "\"Circe\" by Madeline Miller", "\"White Oleander\" by Janet Fitch"], "negative": ["\"Johnny Got His Gun\" by Dalton Trumbo", "\"A Smart Girl's Guide to Sticky Situations: How to Tackle Tricky, Icky Problems and Tough Times\" by American Girl Editors", "\"Sirens of Titan\" by Kurt Vonnegut", "\"The Gates\" by John Connelly", "\"When Helping Hurts: How to Alleviate Poverty Without Hurting the Poor\" by Steve Corbett and Brian Fikkert"]}, "This user is looking for books that can subtly introduce their fundamentalist evangelical family to aspects of life that they might not consider or intentionally avoid due to their strong religious faith. The user wants to expose their family to the issues of racism in missionary work, homophobia, internalized racism, ignorance, the disenfranchisement of science and history, and the freedom of individuality and the secular world. The user prefers books that don't contain explicit language or sexual content, as such content would cause their family to stop reading. The user seems to value open-mindedness and empathy and hopes that their family can learn to appreciate these values through the books they bring on their visit.": {"positive": ["\"The No. 1 Ladies' Detective Agency\" by Alexander McCall Smith", "\"Educated\" by Tara Westover", "\"Man's Search For Meaning\" by Victor Frankl", "\"When Helping Hurts: How to Alleviate Poverty Without Hurting the Poor\" by Steve Corbett and Brian Fikkert", "\"Unclean\" by Richard Beck"], "negative": ["\"Do Androids Dream of Electric Sheep?\" by Philip K. Dick", "\"The Stormlight Archives\" by Brandon Sanderson", "\"The Riyria Revelations\" by Michael J. Sullivan", "\"The Executioner's Song\" by Norman Mailer", "\"Sirens of Titan\" by Kurt Vonnegut"]}, "The user seeks unique fantasy books that deviate from traditional fantasy tropes, such as medieval settings, wizards, dragons, heroes, villains, and supernatural creatures. They derive enjoyment from innovative and fresh stories, preferably with surrealistic elements. They admire books like Alice's Adventures in Wonderland for its departure from established fantasy tropes, and they have a particular fondness for the surreal storytelling style of Haruki Murakami and elements of Bizarro fiction. However, they prefer stories that aren't dark, intense, or heavy, and they're looking for a more light-hearted and whimsical \"weird\" world to explore. They are not interested in horror or death-related themes and want to avoid recommendations related to science fiction or common book suggestions such as the House of Leaves.": {"positive": ["\"The Dresden Files\" by Jim Butcher", "\"The Dark Tower\" by Stephen King", "\"Jonathan Strange and Mr Norrell\" by Susanna Clarke", "\"Black Sun Rising\" by CS Friedman", "\"His Dark Materials\" by Philip Pullman"], "negative": ["\"Kushiel's Legacy\" by Jacqueline Carey", "\"The Sixth Extinction\" by Elizabeth Kolbert", "\"Fahrenheit 451\" by Ray Bradbury", "\"Uglies\" by Scott Westerfeld", "\"City of Golden Shadow (Otherland, Volume 1)\" by Tad Williams"]}, "The user is seeking to stock a minimal space library at a facility for rescued sex-trafficked girls aged 9-18 with cost effective, quality books available from Half Price Books and online used bookshops. A variety of genres and interests are expressed by the girls, including memoirs, novels by authors like John Green and Johannes Cabal. While a strong focus is being put on practical sections like finance, GED programs, hobbies and skills, religious and self-help books, the user is currently seeking novels, mysteries, historical fictions, trilogies, humorous stories and memoirs. The aim is to find impactful and worthwhile books that can offer the girls an escape, healing, advice, or simply entertainment, truly valuing quality over quantity due to limited space and funds.": {"positive": ["\"Anne of Green Gables\" by Lucy Maud Montgomery", "\"Little House on the Prairie\" by Laura Ingalls Wilder", "\"Hitchhikers Guide to the Galaxy\" by Douglas Adams", "\"Ender's Game\"  by Orson Scott Card", "\"Anastasia Krupnik\" by Lois Lowry"], "negative": ["\"The Passage\" by Justin Cronin", "\"The Lies of Locke Lamora\" by Scott Lynch", "\"Animal Farm\" by George Orwell", "\"The Colour of Magic\" by Terry Pratchett", "\"Insomniacs, We\" by J. Andrew Schrecker"]}, "This user is seeking high fantasy novels or short stories that are set in secondary worlds replete with magic and magical creatures. They have a particular interest in books that are similar to the works of J. R. R. Tolkien, Brandon Sanderson, George R. R.  Martin, and Michael Moorcock. However, they desire to move away from the familiar epic fantasy tropes of world-saving heroes or society-threatening evils. Instead, they express a fascination with narratives revolving around mundane characters like butchers, farmers, blacksmiths, or apprentice alchemists. In essence, they're looking for high fantasy tales that significantly tone down the stakes and focus on the non-heroic lives in fantastical settings.": {"positive": ["\"Night Watch\" by Terry Pratchett", "\"The Goblin Emperor\" by Katherine Addison", "\"The Lies of Locke Lamora\" by Scott Lynch", "\"The Riyria Revelations\" by Michael J. Sullivan", "\"A Wizard of Earthsea\" by Ursula K. Le Guin"], "negative": ["\"Infinite Jest\" by David Foster Wallace", "\"Santaland Diaries\" by David Sedaris", "\"Man's Search for Meaning\" by Viktor Frankl", "\"Are You There, God? It's Me, Margaret\" by Judy Blume", "\"Do Androids Dream of Electric Sheep?\" by Philip K. Dick"]}, "This user is looking for a book of literary merit to read for their AP Literature class. They appreciate books that are layered, thought-provoking, dense with depth for analysis, and provides a fresh perspective. This user particularly enjoyed challenging and classic works such as \"Crime and Punishment\", \"Catcher in the Rye\", \"Catch-22\", and \"Dante's Inferno\". They appreciate books which make them question what they know. They are not a fan of Toni Morrison's work, \"Their Eyes Were Watching God\", \"The Color Purple\", or \"The Awakening\". They are open to dark, edgy, or sexual content and are comfortable with either well-known literature or more obscure works. They are using a mobile device, and apologize for any unusual formatting in their request.": {"positive": ["\"The things They Carried\" by Tim O'Brien", "\"Slaughterhouse-Five\" by Kurt Vonnegut", "\"Zen and the Art of Motorcycle Maintenance\" by Robert Pirsig", "\"A Confederacy of Dunces\" by John Kennedy Toole", "\"Of Mice and Men\" by John Steinbeck"], "negative": ["\"We Are Legion (We Are Bob)\" by Dennis E. Taylor", "\"The Dark Tower\" by Stephen King", "\"The Riyria Revelations\" by Michael J. Sullivan", "\"Harry Potter and the Philosopher's Stone\" by J. K. Rowling", "\"The Seven Deaths of Evelyn Hardcastle\" by Stuart Turton"]}, "This user is interested in transitioning from the \"young adult\" genre to more mature, adult novels, but has often found the latter to disappointingly boring. They favor dystopian-themed novels and have a love for sci-fi elements, as evidenced by their enjoyment of the Hunger Games and The Host by Stephanie Meyer. However, their taste in sci-fi leans towards the moderate, avoiding the over-the-top elements. They seek books that offer more of a challenge, being more intense, thrilling, suspenseful than common young adult novels. Moreover, despite trying authors similar to Jodi Picoult, they found these options too uneventful. It indicates they're looking for more engrossing storylines and possibly characters. They are open to suggestions for books or authors that resemble a more mature version of their previous preferences.": {"positive": ["\"The Handmaid's Tale\" by Margaret Atwood", "\"Never Let Me Go\" by Kazuo Ishiguro", "\"Ready Player One\" by Ernest Cline", "\"Shards of Honor\" by Lois McMaster Bujold", "\"The Curse of Chalion\" Lois McMaster Bujold"], "negative": ["\"The Seven Deaths of Evelyn Hardcastle\" by Stuart Turton", "\"Uglies\" by Scott Westerfeld", "\"Night Watch\" by Terry Pratchett", "\"When Helping Hurts: How to Alleviate Poverty Without Hurting the Poor\" by Steve Corbett and Brian Fikkert", "\"Mans Search for Meaning\" by Viktor Frankl"]}, "This user is a new father of twins, who is eager to read aloud to his children as a form of practice. As someone who has struggled with dyslexia, reading out loud has always been a challenge. However, he's resolved to improve in this area, not just for his own development, but also to better assist his children with their future homework and reading abilities. When it comes to book preference, he enjoys fantasy genre, with authors like Cornelia Funke and Rick Riordan. He has also read all the \"Goosebumps\" series and \"Junie B. Jones\" available in his library. His request, in essence, is for easy-to-read books that he can use to practice his reading skills. His aim is not necessarily for the stories to have pictures or be particularly attention-grabbing for his children, as they are still infants and can't completely comprehend or see the pictures, but rather to help him become comfortable with reading out loud.": {"positive": ["\"Dinosaurs Before Dark (Magic Tree House, No. 1)\" by Mary Pope Osborne and Sal Murdocca", "\"Harry Potter and the Philosopher's Stone\" by J. K. Rowling", "\"Book the First: The Bad Beginning\" by Lemony Snicket", "\"The Lion, the Witch and the Wardrobe\" by C. S. Lewis", "\"The Gates\" by John Connelly"], "negative": ["\"Stoner\" by John Williams", "\"Seveneves\" by Neal Stephenson", "\"The Ocean at the End of the Lane\" by Neil Gaiman", "\"The Weird: A Compendium of Strange and Dark Stories\" by Ann VanderMeer and Jeff VanderMeer", "\"Fahrenheit 451\" by Ray Bradbury"]}, "The user is looking for a modern novel, specifically featuring a strong, independent female heroine. They express dissatisfaction with characters they perceive as weak or overly dependent on men, criticizing examples such as Bella Swan from the Twilight series, Diana Bishop from A Discovery of Witches, and Anastasia Steel from the Fifty Shades series. They also mention a desire for character strength beyond what they found in Patty Berglund from Freedom and Madeleine Hanna from The Marriage Plot. The user is seeking a female character who is not dictated by the men in her life, and who they can look up to as a role model.": {"positive": ["\"Harry Potter and the Philosopher's Stone\" by J. K. Rowling", "\"Outlander\" by Diana Gabaldon", "\"Kushiel's Legacy\" by Jacqueline Carey", "\"The Green Rider\" by Kristen Britain", "\"The Poisonwood Bible\" by Barbara Kingsolver"], "negative": ["\"A Confederacy of Dunces\" by John Kennedy Toole", "\"Leviathan Wakes\" by James S.A. Corey", "\"The Sixth Extinction\" by Elizabeth Kolbert", "\"Man's Search For Meaning\" by Victor Frankl", "\"Lamb\" by Christopher Moore"]}, "This user is a fan of adult fantasy, but finds many of the genre's typical elements—including grimdark themes, political drama, and pretentiousness—off-putting. They have difficulty engaging with overly cynical narratives, citing the popular Game of Thrones series and the Wayfarer's Redemption series as examples. They also have a limited tolerance for stories that feature problematic portrayals of gender roles, as seen in their dislike of The Child Thief. They seek fantasy books that, while perhaps including dark elements or weird features, also incorporate a sense of fun and adventure. The user's favorite book is The Phantom Tollbooth, and they also enjoy films like Alice in Wonderland, Spirited Away, The Nightmare Before Christmas, Corpse Bride, and Coraline, indicating a preference for quirky, whimsical narratives that maintain a lighter, more hopeful tone.": {"positive": ["\"The Lies of Locke Lamora\" by Scott Lynch", "\"Nine Princes in Amber\" by Roger Zelazny", "\"The Cleric Quintet\" by R. A. Salvatore", "\"A Darker Shade of Magic: A Novel\" by V.E. Schwab", "\"The Eyre Affair: A Thursday Next Novel\" by Jasper Fforde"], "negative": ["\"The Three Stigmata of Palmer Eldritch\" by Philip K. Dick", "\"The Gates\" by John Connelly", "\"A Confederacy of Dunces\" by John Kennedy Toole", "\"Educated\" by Tara Westover", "\"The Fifth Season\" by N.K. Jemisin"]}, "This user is an avid reader who particularly enjoys novels that are so engrossing they can be read in one sitting and retain their impact even after the book is finished. They appreciate all genres, with the notable exception of paranormal, distinguishing it from fantasy, which they indeed love. What is critically important to them is well-developed, multifaceted characters and beautifully crafted prose. They have an appreciation for linguistic mastery and clearly relish in vibrant, emotive language. An example of a recent read that fulfilled their preferences was Nigel Farndale's \"The Road Between Us\". Although admitting it was not perfect, they found its rich language and compelling, complex characters thoroughly satisfying. They have a spontaneous approach to selecting books, with true one-sittings happening quite rarely without a specific logic or reason behind their choices. They are now seeking more of these enrapturing, one-sit reads.": {"positive": ["\"Black Hole\" by Charles Burns\"", "\"Mistborn: The Final Empire\" by Brandon Sanderson", "\"Siddhartha\" by Hermann Hesse", "\"Slaughterhouse-Five\" by Kurt Vonnegut\"", "\"Shantaram\" by Gregory David Roberts"], "negative": ["\"The Passage\" by Justin Cronin", "\"Stoner\" by John Williams", "\"Are You There, God? It's Me, Margaret\" by Judy Blume", "\"Neuromancer\" by William Gibson", "\"A Wizard of Earthsea\" by Ursula K. Le Guin"]}, "This user is looking for science fiction or fantasy books that have a strong humor sub-genre. They appreciate works similar to those of authors John Scalzi and Terry Pratchett. Some of the user's well-liked books which they consider to align with this preference include \"Ready Player One\" by Ernest Cline, \"Off To Be The Wizard\" by Scott Meyer, \"Hounded\" by Kevin Hearne, and \"The Martian\" by Andy Weir. They welcome all suggestions and enjoy discovering new books based on these genre preferences.": {"positive": ["\"Hitchikers Guide to the Galaxy\" by Douglas Adams", "\"The Colour of Magic\" by Terry Pratchett", "\"Sirens of Titan\" by Kurt Vonnegut", "\"Slaughterhouse-Five\" by Kurt Vonnegut", "\"We Are Legion (We Are Bob)\" by Dennis E. Taylor"], "negative": ["\"Neuromancer\" by William Gibson", "\"Our Bodies, Ourselves\" by Boston Women's Health Book Collective", "\"The Dark Tower: The Gunslinger\" by Stephen King", "\"Moriarty\" by Anthony Horowitz", "\"Kushiel's Legacy\" by Jacqueline Carey"]}, "This user has a diverse and sophisticated taste in literature, with a lean towards classics and thought-provoking narratives. They enjoy both British and American authors and have interest in a variety of genres like dystopian fiction, science fiction, philosophical literature, romance, and contemporary fantasy. Some of their predetermined choices include works by George Orwell, Aldous Huxley, Kurt Vonnegut, Joseph Heller, Alexandre Dumas, Frank Herbert, John Steinbeck, Muriel Barbery, Dolly Alderton, Ray Bradbury, Daniel Keyes, Seneca, Antoine de Saint-Exupery, Vladimir Nabokov, and Ted Chiang. They are open to suggestions and seem to enjoy a good discussion about books and reading order. They also seem to value the opinions of other readers, indicating a sense of community in their reading habits.": {"positive": ["\"Animal Farm\" by George Orwell", "\"Flowers for Algernon\" by Daniel Keyes", "\"Catch-22\" by Joseph Helle", "\"Fahrenheit 451\" by Ray Bradbury", "\"Lolita\" by Vladimir Nabokov"], "negative": ["\"The Caves of Steel\" by Isaac Asimov", "\"When Helping Hurts: How to Alleviate Poverty Without Hurting the Poor\" by Steve Corbett and Brian Fikkert", "\"The Poisonwood Bible\" by Barbara Kingsolver", "\"The Passage\" by Justin Cronin", "\"The Hitchhiker's Guide to the Galaxy\" by Douglas Adams"]}, "This user has a vast collection of books but one lacking significantly in works written by female authors. They have only identified \"To Kill a Mockingbird,\" \"Harry Potter,\" \"Atlas Shrugged,\" and \"The Hunger games\" among their collection as written by women. This reader enjoys a variety of genres as reflected in their top three favorites: the high fantasy of \"The Silmarillion,\" the comedic science fiction of \"The Hitchhiker's Guide to the Galaxy,\" and the adventurous \"The Adventures of Tom Sawyer\". It's clear that this user prefers stories with a fun, light-hearted protagonist over serious, dark, and brooding characters. They also have an appreciation for creation myths and adventure narratives. They're looking to diversify their bookshelf and incorporate a broader range of perspectives, most notably from female authors.": {"positive": ["\"The Dispossessed: An Ambiguous Utopia\" by Ursula K. Le Guin", "\"The Left Hand of Darkness\" by Ursula K. Le Guin", "\"The Sparrow\" by Mary Doria Russell", "\"The Secret Diary of Adrian Mole\" by Sue Townsend", "\"The Word for World is Forest\" by Ursula K. Le Guin"], "negative": ["\"Fahrenheit 451\" by Ray Bradbury", "\"The Lion, the Witch and the Wardrobe\" by C. S. Lewis", "\"The City and The City\" by China Mieville", "\"Alanna: The First Adventure\" by Tamora Pierce", "\"The Lies of Locke Lamora\" by Scott Lynch"]}, "This user is seeking book recommendations featuring a distinctive atmosphere similar to the worlds penned in 'Blade Runner', 'Altered Carbon', 'Star Wars Episode II', and 'The Fifth Element'. They are interested in stories that highlight the darker and intricate aspects of a city, illuminated by contrasting artificial lightscapes. The user is drawn to the settings filled with underground bars, gritty streets plagued with crime, as well as locales inhabited by 'hustlers' and other criminals.": {"positive": ["\"Do Androids Dream of Electric Sheep?\" by Philip K. Dick", "\"Neuromancer\" by William Gibson", "\"The Caves of Steel\" by Isaac Asimov", "\"The City and The City\" by China Mieville", "\"Leviathan Wakes\" by James S. A. Corey"], "negative": ["\"The Sparrow\" by Mary Doria Russell", "\"Outlander\" by Diana Gabaldon", "\"Unclean\" by Richard Beck", "\"A Smart Girl's Guide to Sticky Situations: How to Tackle Tricky, Icky Problems and Tough Times\" by American Girl Editors", "\"Good Omens\" by Neil Gaiman and Terry Pratchett"]}, "This user is a fan of post-apocalyptic and dystopian future books, with a preference for titles that may not be mainstream young adult reads. They enjoy books that echo the mood and sense of loneliness found in apocalyptic settings, similar to the video game, The Division, and the film, I am Legend. Examples of books they have enjoyed include The Hunger Games, Divergent, The Last Dog on Earth by Adrian Walker, and the Gone series by Michael Grant. They also enjoyed The Fifth Wave but are not particularly interested in alien and space themes. On their book wish-list are One Second After by William R. Forstchen, The Road by Cormac McCarthy, and Outside by Shalini Boland.": {"positive": ["\"Wool\" by Hugh Howey", "\"The Road\" by Cormac McCarthy", "\"Oryx and Crake\" by Margaret Atwood", "\"Station Eleven\" by Emily St. John Mandel", "\"Red Rising\" by Pierce Brown"], "negative": ["\"A Smart Girl's Guide to Sticky Situations: How to Tackle Tricky, Icky Problems and Tough Times\" by American Girl Editors", "\"The Poisonwood Bible\" by Barbara Kingsolver", "\"Animal Farm\" by George Orwell", "\"The Seven Deaths of Evelyn Hardcastle\" by Stuart Turton", "\"Leviathan Wakes\" by James S. A. Corey"]}, "This user has a strong preference for apocalyptic, post-apocalyptic, and dystopian novels. They have a distinct disinterest in zombie themes but are willing to consider highly recommended books within this subgenre. They are open to both electronic versions, ideally for their Kindle, and physical copies of books. Their reading history includes works such as The Silo Saga by Hugh Howey, From the Fire by Kent David Kelly, Apocalypse Z by Manel Loureiro, and popular dystopian series such as Divergent by Veronica Roth and The Hunger Games by Suzanne Collins. They are currently in search of fresh recommendations within the same genre.": {"positive": ["\"The Passage\" by Justin Cronin", "\"I Am Legend\" by Richard Matheson", "\"The Dog Stars\" by Peter Heller", "\"On the Beach\" by Neville Shute", "\"Metro 2033\" by Dmitrij Gluchovski"], "negative": ["\"Are You There, God? It's Me, Margaret\" by Judy Blume", "\"Siddhartha\" by Hermann Hesse", "\"Circe\" by Madeline Miller", "\"The Handmaid's Tale\" by Margaret Atwood.", "\"The Lion, the Witch and the Wardrobe\" by C. S. Lewis"]}, "This user is a 27-year-old who has never indulged in reading for pleasure before, but is now looking to explore this hobby. They are beginning their reading journey with the book - 'Thinking, Fast and Slow' by Daniel Khaneman and are open to recommendations for their next read. Their preferences lean towards books that are educational, and help in personal development or are business-oriented, implying an interest in non-fiction. Although they are familiar with researching books, they find the plethora of options overwhelming.": {"positive": ["\"Hitchhikers Guide to the Galaxy\" by Douglas Adams", "\"Cat's Cradle\" by Kurt Vonnegut", "\"Catch-22\" by Joseph Heller", "\"The Da Vinci Code\" by Dan Brown", "\"Prey\" by Micheal Crichton"], "negative": ["\"Night Watch\" by Terry Pratchett", "\"The Caves of Steel\" by Isaac Asimov", "\"The Green Rider\" by Kristen Britain", "\"Magpie Murders\" by Anthony Horowitz", "\"The Dresden Files\" by Jim Butcher"]}, "The user enjoys books that are exceptionally funny and capable of making them laugh out loud frequently. They have struggled to find such books in the past and have been disappointed by a number of recommendations. Books such as 'Lamb: The Gospel of Biff' and 'The Hitchhiker's Guide to the Galaxy' were not to their taste as they found their humor to be either too silly, annoying, or just not funny. Celebrity-authored books by comedians like Tina Fey and Mindy Kaling also failed to amuse them. However, they found 'The Disaster Artist' hilarious and mentioned that it is the only book that has regularly made them laugh out loud. Their sense of humor is reflected in their enjoyment of TV shows like 'The Office', 'Parks and Rec', 'It's Always Sunny in Philadelphia', 'Curb Your Enthusiasm', and movies by Judd Apatow and those like 'Shaun of the Dead' and 'Hot Fuzz'. They would like recommendations that align more closely with their preferred humor style.": {"positive": ["\"Santaland Diaries\" by David Sedaris", "\"Good Omens\" by Neil Gaiman and Terry Pratchett", "\"Furiously Happy\" by Jenny Lawson", "\"A Confederacy of Dunces\" by John Kennedy Toole", "\"The Color of Magic\" by Terry Pratchett"], "negative": ["\"The City and The City\" by China Mieville", "\"Mans Search for Meaning\" by Viktor Frankl", "\"Wool\" by Hugh Howey", "\"Animal Farm\" by George Orwell", "\"The Lion, the Witch and the Wardrobe\" by C. S. Lewis"]}, "This user is an avid reader, specifically of the fantasy genre, with a passion for series like Dragonlance, Wheel of Time, and Game of Thrones. They are now seeking to delve into non-fiction literature for the first time since leaving school and are particularly interested in historical or science/technology-related topics. The user is open to recommendations and is looking for highly engaging non-fiction books that can captivate their attention similarly to how novels do. They are open to compelling reads that have made a significant impact, the type of book that one would enthusiastically recommend as a \"must-read.": {"positive": ["\"A People's History of the United States\" by Howard Zinn", "\"Surely You're Joking, Mr. Feynman\" by Richard P. Feynman", "\"Jarhead\" by Anthony Swofford", "\"With the Old Breed\" by Eugene B. Sledge", "\"Making the Corps\" by Thomas Ricks"], "negative": ["\"The House of Silk\" by Anthony Horowitz", "\"Neuromancer\" by William Gibson", "\"The Riyria Revelations\" by Michael J. Sullivan", "\"The Gates\" by John Connelly", "\"The Poisonwood Bible\" by Barbara Kingsolver"]}, "This user is in their early 30s and looking for books that reflect their current state of frustration and discontentment with the world. They feel irritated by mundane and seemingly illogical aspects of life, such as commuting and bureaucratic decisions. Despite recognizing that their perspective might be biased due to their age and unique life experiences, they remain eager to explore literature that tackles these feelings of anger toward the world and the feeling of brokenness that they perceive in day-to-day life. They believe their current mindset to be a phase and are open to readings that may have explored similar emotions.": {"positive": ["\"Letters from a Stoic\" by Seneca", "\"Man's Search for Meaning\" by Viktor Frankl", "\"Stoner\" by John Williams", "\"Enlightenment Now\" by Steven Pinker", "\"Insomniacs, We\" by J. Andrew Schrecker"], "negative": ["\"The City and The City\" by China Mieville", "\"The Seven Deaths of Evelyn Hardcastle\" by Stuart Turton", "\"Sirens of Titan\" by Kurt Vonnegut", "\"Dinosaurs Before Dark (Magic Tree House, No. 1)\" by Mary Pope Osborne and Sal Murdocca", "\"The Riyria Revelations\" by Michael J. Sullivan"]}, "This user enjoys books that allow them to deeply connect with the characters, experiencing their emotions alongside them. They particularly enjoyed \"Exit Here\" by Jason Myers as it provided this level of immersion. They find themselves drawn to the works of Lurlene McDaniel - the author's recurring themes of trauma and resilience resonates with them on a personal level. Even though they don't find McDaniel's books to be particularly challenging, they take pleasure in the emotional journey her stories evoke.": {"positive": ["\"The Count of Monte Cristo\" by Alexandre Dumas", "\"Blood Meridian\" by Cormac McCarthy", "\"The Hobbit\" by J.R.R. Tolkien", "\"Good Omens\" by Terry Pratchett and Neil Gaiman", "\"The Bluest Eye\" by Toni Morrison"], "negative": ["\"The Lies of Locke Lamora\" by Scott Lynch", "\"Book the First: The Bad Beginning\" by Lemony Snicket", "\"Leviathan Wakes\" by James S.A. Corey", "\"Wool\" by Hugh Howey", "\"The Seven Deaths of Evelyn Hardcastle\" by Stuart Turton"]}, "This user prefers lengthy books or series that offer deep emotional engagement and involvement with the characters and narratives. They have a keen interest in the adventure fantasy genre with an emphasis on extensive world-building and character development. Stories that are immersive to the point where they encourage the user to keep thinking about the characters and plot outside of their reading time are greatly valued. Although their primary genre preference is fantasy, they are also open to science fiction, mystery, thriller, or any other genre that skillfully combines plot and character-driven narratives. With books that inspire curiosity about what occurs next, the user desires reading experiences that disconnect them from reality and enable them to immerse themselves in a different world.": {"positive": ["\"His Dark Materials\" by Philip Pullman", "\"Wheel of Time\" by Robert Jordan", "\"The Stormlight Archives\" by Brandon Sanderson", "\"Mistborn: The Final Empire\" by Brandon Sanderson", "\"Malazan Book of the Fallen\" by Steven Erikson"], "negative": ["\"When Helping Hurts: How to Alleviate Poverty Without Hurting the Poor\" by Steve Corbett and Brian Fikkert", "\"Wool\" by Hugh Howey", "\"The Color of Magic\" by Terry Pratchett", "\"Homo Deus\" by Yuval Noah Harari", "\"Good Omens\" by Neil Gaiman and Terry Pratchett"]}, "This user is looking for profound and thought-provoking books that stimulate reflection on the meaning of life and possibly instigate life-changing viewpoints. This reader is open to both fiction and nonfiction genres, with a preference for themes that involve human experience, after-death narratives, and life beyond our planet. They are particularly interested in books that significantly impact one's journey towards enlightenment and the pursuit of knowledge or truth. Books that have the power to alter one's consciousness or view of things are especially desirable. This user delights in intellectual exploration and self-exploration .": {"positive": ["\"Mans Search for Meaning\" by Viktor Frankl", "\"The Myth of Sisyphus\" by Albert Camus", "\"Sapiens\" by Yuval Noah Harari", "\"The Sixth Extinction\" by Elizabeth Kolbert", "\"Homo Deus\" by Yuval Noah Harari"], "negative": ["\"His Dark Materials\" by Philip Pullman", "\"Taipan\" by James Clavell", "\"The Color of Magic\" by Terry Pratchett", "\"The Period Book : Everything You Don't Want to Ask (But Need to Know)\" by Jennifer Gravelle, Karen, and Gravelle", "\"The Colour of Magic\" by Terry Pratchett"]}, "This user is seeking adult dystopian novels, expressing weariness with common tropes of teenage protagonists rising against oppressive governments. They are particularly interested in storylines involving adult characters, ideally ones with families, being the instigators and key figures in rebellions or resistance movements within a dystopian setting. The user wants recommendations for books that focus more on the impact of dystopian societies on adults.": {"positive": ["\"Wool\" by Hugh Howey", "\"Fahrenheit 451\" by Ray Bradbury", "\"V for Vendetta\" by Alan Moore.", "\"The Postmortal\" by Drew Magary", "\"The Three Stigmata of Palmer Eldritch\" by Philip K. Dick"], "negative": ["\"We Are Legion (We Are Bob)\" by Dennis E. Taylor", "\"The Hitchhiker's Guide to the Galaxy\" by Douglas Adams", "\"Circe\" by Madeline Miller", "\"The Riyria Revelations\" by Michael J. Sullivan", "\"Slaughterhouse-Five\" by Kurt Vonnegut\""]}, "This user is seeking wholesome and uplifting novels in order to help them navigate a difficult period in their life. They've previously been reading novels by authors such as Bukowski and Murakami, which are often tinged with sadness. They are now actively seeking to change their reading habits to encourage positivity. Not interested in self-help books, they're after novels or similarly style narratives that could help alleviate feelings of anxiety, loneliness, and financial stress. They are open to books on any subject, as long as they fall under the umbrella of being 'feel-good' stories.": {"positive": ["\"Eleanor Oliphant is Completely Fine\" by Gail Honeyman", "\"A Man Called Ove\" by Fredrik Backman", "\"The Colour of Magic\" by Terry Pratchett", "\"Anne of Green Gables\" by L.M. Montgomery", "\"The House at Pooh Corner\" by A. A. Milne"], "negative": ["\"Alanna: The First Adventure\" by Tamora Pierce", "\"Man's Search For Meaning\" by Victor Frankl", "\"Kushiel's Legacy\" by Jacqueline Carey", "\"City of Golden Shadow (Otherland, Volume 1)\" by Tad Williams", "\"The Riyria Revelations\" by Michael J. Sullivan"]}, "This user is attracted to books that deeply resonate with them and leave a lasting impact, often leading to what they describe as a \"book hangover\". This includes books that touch them in such a way that they feel a sense of loss or sadness when the book or series ends. They also express that these books often cause them to lose interest in other books for a period of time, or lead them to read lighter, sillier books just to distract their mind. The user also notes that certain books can stir strong emotional reactions, such as depression or anxiety. They're interested in knowing other people's experiences with such emotionally impactful books.": {"positive": ["\"The Handmaid's Tale\" by Margaret Atwood.", "\"The Dark Tower: The Gunslinger\" by Stephen King", "\"The Way of Kings\" by Brandon Sanderson", "\"Mistborn: The Final Empire\" by Brandon Sanderson", "\"Infinite Jest\" by David Foster Wallace"], "negative": ["\"Neuromancer\" by William Gibson", "\"We Are Legion (We Are Bob)\" by Dennis E. Taylor", "\"The No. 1 Ladies' Detective Agency\" by Alexander McCall Smith", "\"Seveneves\" by Neal Stephenson", "\"A Smart Girl's Guide to Sticky Situations: How to Tackle Tricky, Icky Problems and Tough Times\" by American Girl Editors"]}, "This user is interested in lengthy books that can be gradually read over the course of a month. They are open to various genres but have a preference for Greek literature, as indicated by their girlfriend's interest in such. The user mentioned the novel \"Like Water for Chocolate\" as their girlfriend's favorite, hinting at an appreciation for romantic or magical realist stories. The user's personal favorites include \"Good Omens\" and \"Catch-22\", suggesting an enjoyment of witty humor, fantasy, and satirical content. This user seems to be searching for books that would be suitable for a two-person book club, emphasizing the need for discussion-worthy content.": {"positive": ["\"The Count of Monte Cristo\" by Alexandre Dumas", "\"The Eye of the World (The Wheel of Time, Book 1)\" by Robert Jordan.", "\"Circe\" by Madeline Miller", "\"Jonathan Strange & Mr Norrell\" by Susanna Clarke", "\"The Goldfinch\" by Donna Tartt"], "negative": ["\"The Fifth Season\" by N.K. Jemisin", "\"Leviathan Wakes\" by James S. A. Corey", "\"The Sixth Extinction\" by Elizabeth Kolbert", "\"Letters from a Stoic\" by Seneca", "\"The Green Rider\" by Kristen Britain"]}, "This user is an avid reader with a preference for substantial, lengthy series that can keep them engaged for long periods of time. They enjoy books with a high fantasy or science-fiction bent, mentioning series such as Kingkiller, the Lamora series, Dresden Files, Codex Alera, Eragon, and the Drizzt books in their favorites list. Despite their enjoyment of these genres, they also like stories that do not follow the usual fantasy or sci-fi formula, desiring a sense of wit and unexpectedness in their reads. They have already delved into staples like Shanarra, Earthsea, and works by David Gemmell. They are seeking more unusual, formula-breaking tales that can quench their insatiable thirst for reading.": {"positive": ["\"A Game of Thrones\" by George R.R. Martin", "\"Dune\" by Frank Herbert", "\"The Fifth Season\" by N.K. Jemisin", "\"The Hitchhiker's Guide to the Galaxy\" by Douglas Adams.", "\"Small Gods\" by Terry Pratchett"], "negative": ["\"Homo Deus\" by Yuval Noah Harari", "\"The Three Stigmata of Palmer Eldritch\" by Philip K. Dick", "\"Neuromancer\" by William Gibson", "\"Harry Potter and the Philosopher's Stone\" by J. K. Rowling", "\"Good Omens\" by Neil Gaiman and Terry Pratchett"]}, "This user is interested in novels or series that focus on constructing complex, future worlds set on Earth, often with post-apocalyptic civilization rebuilding themes. This user enjoys books similar to the Mortal Engines and Red Rising series, which provide a picture of societies far advanced from our present times. They have a special preference for books that include a unique, world-specific language to enhance the immersion into these future societies. The user is positively opened to any other titles with a similar theme and would appreciate any recommendations provided.": {"positive": ["\"The Fifth Season\" by N.K. Jemisin", "\"Seveneves\" by Neal Stephenson", "\"Leviathan Wakes\" by James S.A. Corey", "\"Uglies\" by Scott Westerfeld", "\"The Passage\" by Justin Cronin"], "negative": ["\"The Period Book : Everything You Don't Want to Ask (But Need to Know)\" by Jennifer Gravelle, Karen, and Gravelle", "\"The Green Rider\" by Kristen Britain", "\"A Confederacy of Dunces\" by John Kennedy Toole", "\"Santaland Diaries\" by David Sedaris", "\"Mistborn: The Final Empire\" by Brandon Sanderson"]}, "This user is an avid reader of murder mystery novels, particularly interested in the classic whodunnit style. They enjoy books similar to Sherlock Holmes series and Agatha Christie's works. The user prefers mysteries where the solution can be logically figured out from the clues presented in the story.": {"positive": ["\"The Seven Deaths of Evelyn Hardcastle\" by Stuart Turton", "\"The Cuckoo's Calling\" by Robert Galbraith", "\"The House of Silk\" by Anthony Horowitz", "\"Moriarty\" by Anthony Horowitz", "\"Magpie Murders\" by Anthony Horowitz"], "negative": ["\"Harry Potter and the Philosopher's Stone\" by J. K. Rowling", "\"Night Watch\" by Terry Pratchett", "\"The No. 1 Ladies' Detective Agency\" by Alexander McCall Smith", "\"We Are Legion (We Are Bob)\" by Dennis E. Taylor", "\"Good Omens\" by Neil Gaiman and Terry Pratchett"]}, "The user is seeking books where the main characters are suddenly pulled into a completely different world, setting them on an unexpected adventure. They enjoy stories where the main characters start from a commonplace life and transition into extraordinary circumstances. They have a preference for fantasy settings, as indicated by their examples: The Lord of the Rings, where average hobbits embark on a quest to save mankind; Neverwhere, featuring an accountant drawn into a hidden world underneath London; and Harry Potter, the story of an unsuspecting boy who discovers he's a wizard and joins a magical world. The user is receptive to all genres, given that their suggested books encompass a variety.": {"positive": ["\"The Ocean at the End of the Lane\" by Neil Gaiman.", "\"Outlander\" by Diana Gabaldon", "\"Shades of Magic\" by V.E. Schwab", "\"Jonathan Strange & Mr Norrell\" by Susanna Clarke", "\"The Merchant of Death\" by D.J. MacHale"], "negative": ["\"V for Vendetta\" by Alan Moore.", "\"Unclean\" by Richard Beck", "\"Good Omens\" by Neil Gaiman and Terry Pratchett", "\"Stoner\" by John Williams", "\"The Myth of Sisyphus\" by Albert Camus"]}, "This user is an enthusiast of intricately woven narratives similar to the structure of Game of Thrones' \"A Song of Ice and Fire\" series. They enjoy multiple point of view characters, great dialogues, as well as the intrigue, duplicity, and politics embedded in the plot. The user values complex narratives with morally ambiguous characters, refraining from the basic dichotomy of good vs evil. Despite their liking for complex plots, they have an aversion to fantasy elements like magic and dragons. Historical accuracy isn't essential, but they appreciate it as an added bonus. They are open to books that may be complex, long, or require a literary understanding as long as the content maintains their interest.": {"positive": ["\"The Black Dahlia\" by James Ellroy", "\"Perfidia\" by James Ellroy", "\"American Tabloid\" by James Ellroy", "\"The Plantagenets\" by Dan Jones", "\"Taipan\" by James Clavell"], "negative": ["\"Sapiens\" by Yuval Noah Harari", "\"The No. 1 Ladies' Detective Agency\" by Alexander McCall Smith", "\"Leviathan Wakes\" by James S. A. Corey", "\"A Smart Girl's Guide to Sticky Situations: How to Tackle Tricky, Icky Problems and Tough Times\" by American Girl Editors", "\"Uglies\" by Scott Westerfeld"]}, "This user is seeking a compelling book that they can finish in a single night, preferably within the science fiction genre. They would like a book so engaging that it could be considered a \"must-read\". Although they usually prefer to avoid comedy, romance, and non-fiction biographies, they remained open to suggestions from these genres if the book is exceptionally good. They appreciates and are open to any recommendations.": {"positive": ["\"A Wizard of Earthsea\" by Ursula Le Guin", "\"The Ocean at the End of the Lane\" by Neil Gaiman", "\"Siddhartha\" by Hermann Hesse", "\"City of Golden Shadow (Otherland, Volume 1)\" by Tad Williams", "\"Animal Farm\" by George Orwell"], "negative": ["\"Cows\" by Matthew Stokoe", "\"The Dark Tower\" by Stephen King", "\"Anne of Green Gables\" by Lucy Maud Montgomery", "\"The Lies of Locke Lamora\" by Scott Lynch", "\"The Three Stigmata of Palmer Eldritch\" by Philip K. Dick"]}, "This user appreciates deeply thought-provoking reads that offer philosophical insight and emotional resonance, as evidenced by their recommendation of \"Flowers for Algernon\". They also enjoy stories that offer a fresh perspective and challenge conventional thinking, demonstrated by their fascination with \"Flow My Tears, the Policeman Said\". Beyond introspective and mind-bending narratives, the user also shows an interest in action-packed adventure series that keep one hooked, as suggested by their recommendation of the \"ASOIAF\" (A Song of Ice and Fire) books.": {"positive": ["\"Little Brother\" by Cory Doctorow", "\"Harry Potter and the Sorcerer's Stone\" by J.K. Rowling", "\"The Lost Hero\" by Rick Riordan", "\"Divergent\" by Veronica Roth", "\"The Hitchhiker's Guide to the Galaxy\" by Douglas Adams"], "negative": ["\"City of Golden Shadow (Otherland, Volume 1)\" by Tad Williams", "\"Fahrenheit 451\" by Ray Bradbury", "\"The Goblin Emperor\" by Katherine Addison", "\"The Lion, the Witch and the Wardrobe\" by C. S. Lewis", "\"Uglies\" by Scott Westerfeld"]}, "This user enjoys profound and thought-provoking books that explore the dark and often frightening aspects of human nature, much like how \"The Lord of the Flies\" did. They appreciate stories that showcase humanity in unusual and distressing situations, which force the reader to reflect on the potential capabilities of humans. The idea of 'mind-blowing, honestly possible situations' is particularly appealing to them. This user seems to prefer books that challenge conventional perspectives on humanity and provoke a deeper understanding of our fundamental nature. They are open to suggestions from other readers on similar thought-provoking reads.": {"positive": ["\"Flowers For Algernon\" by Daniel Keyes", "\"Slaughterhouse-Five\" by Kurt Vonnegut", "\"Heart of Darkness\" by Joseph Conrad", "\"The Complete Maus: A Survivor's Tale\" by Art Spiegelman", "\"The Road\" by Cormac McCarthy"], "negative": ["\"The Fifth Season\" by N.K. Jemisin", "\"Santaland Diaries\" by David Sedaris", "\"Kushiel's Legacy\" by Jacqueline Carey", "\"Do Androids Dream of Electric Sheep?\" by Philip K. Dick", "\"Alanna: The First Adventure\" by Tamora Pierce"]}, "This user is seeking book recommendations for their spouse who enjoys reading engaging stories, particularly in the sci-fi genre similar to Star Wars. The spouse has been dealing with depression and so, the user believes a captivating narrative would offer them a form of respite and escapism. This is why they're looking for stories offering deep immersion, instead of just self-help books. They have also indicated that their spouse isn't necessarily committed to just one genre, displaying openness to other genres as long as the story proves compelling enough.": {"positive": ["\"The Colour of Magic\" by Terry Pratchett", "\"We Are Legion (We Are Bob)\" by Dennis E. Taylor", "\"Leviathan Wakes\" by James S.A. Corey", "\"Red Rising\" by Pierce Brown", "\"Culture novels\" by Iain M. Banks"], "negative": ["\"The Postmortal\" by Drew Magary", "\"Are You There, God? It's Me, Margaret\" by Judy Blume", "\"Magpie Murders\" by Anthony Horowitz", "\"Leviathan Wakes\" by James S. A. Corey", "\"Man's Search For Meaning\" by Victor Frankl"]}, "This user is a true connoisseur of the horror genre, seeking to confront the darkest, most terrifying books available. They are unimpressed with popular horror writers like Stephen King, stating that these authors do not reach the level of horror they crave. The user specifically mentions wanting \"nightmares for years\". In addition to the bone-chilling component, the user appreciates the artistic side of horror narratives, citing favorite films like 'The Shining' and 'The Witch'. This appreciation suggests they may be interested in books that are not just horrifying, but exceptionally well written and deeply atmospheric. Least but not last, there seems to be a particular interest in ancient tombs, dark blood magic, or any elements that hark back to old-worldly horror or folklore.": {"positive": ["\"I Have No Mouth And I Must Scream\" by Harlan Ellison", "\"The Weird: A Compendium of Strange and Dark Stories\" by Ann VanderMeer and Jeff VanderMeer", "\"This Darkness Mine\" by Mindy McGinnis", "\"Cows\" by Matthew Stokoe", "\"Johnny Got His Gun\" by Dalton Trumbo"], "negative": ["\"The Fifth Season\" by N.K. Jemisin", "\"The Ocean at the End of the Lane\" by Neil Gaiman", "\"Sapiens\" by Yuval Noah Harari", "\"Lamb\" by Christopher Moore", "\"Book the First: The Bad Beginning\" by Lemony Snicket"]}}